### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_iam_policy.additional_inline[0] will be created
+   resource "aws_iam_policy" "additional_inline" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "cataprato-auth-lambda-inline"
+       name_prefix = (known after apply)
+       path        = "/tf-managed/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "dynamodb:UpdateItem",
+                           "dynamodb:Scan",
+                           "dynamodb:Query",
+                           "dynamodb:PutItem",
+                           "dynamodb:GetItem",
+                           "dynamodb:BatchWriteItem",
+                           "dynamodb:BatchGetItem",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:dynamodb:us-east-1:350131064538:table/Users"
+                       Sid      = "dynamodb"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "Deployment" = "terraform"
        }
+       tags_all    = {
+           "Deployment" = "terraform"
        }
    }

  # module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_inline" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "cataprato-auth-lambda"
    }

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:26",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:22" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:22/invocations" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "22" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "22" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8481083989546049218" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692051324207914200" -> "1692068950572439000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:26" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-14T22:16:24.241+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:26" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/ec858f1f2f3d80024ca399a08834b72e5e906e7dec12c60c4894a12a7155b5f4.zip" -> "builds/93dd7c26b61a151d338c3d3c4744c44da20e80ee48a81d0ad8b6a7383c7c6a1b.zip"
!       s3_object_version           = "bf6vruAL9THBPaxKGT9Mmc3Qq0EN3hOv" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "aCFLS8TCic+K9FOuwTU7URY1Chy66U3KZrqsXujy+LM=" -> (known after apply)
!       source_code_size            = 29713441 -> (known after apply)
!       version                     = "26" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "fecf07d3c08d747c8af9a33de926058d-6" -> (known after apply)
!       id                     = "builds/ec858f1f2f3d80024ca399a08834b72e5e906e7dec12c60c4894a12a7155b5f4.zip" -> (known after apply)
!       key                    = "builds/ec858f1f2f3d80024ca399a08834b72e5e906e7dec12c60c4894a12a7155b5f4.zip" -> "builds/93dd7c26b61a151d338c3d3c4744c44da20e80ee48a81d0ad8b6a7383c7c6a1b.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/ec858f1f2f3d80024ca399a08834b72e5e906e7dec12c60c4894a12a7155b5f4.zip" -> "builds/93dd7c26b61a151d338c3d3c4744c44da20e80ee48a81d0ad8b6a7383c7c6a1b.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "bf6vruAL9THBPaxKGT9Mmc3Qq0EN3hOv" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/93dd7c26b61a151d338c3d3c4744c44da20e80ee48a81d0ad8b6a7383c7c6a1b.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/93dd7c26b61a151d338c3d3c4744c44da20e80ee48a81d0ad8b6a7383c7c6a1b.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7102207605888477183" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/ec858f1f2f3d80024ca399a08834b72e5e906e7dec12c60c4894a12a7155b5f4.zip" -> "builds/93dd7c26b61a151d338c3d3c4744c44da20e80ee48a81d0ad8b6a7383c7c6a1b.zip"
!           "timestamp" = "1692051325785522000" -> "1692068952168018200"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "5871763361317540754" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/ec858f1f2f3d80024ca399a08834b72e5e906e7dec12c60c4894a12a7155b5f4.zip" -> "builds/93dd7c26b61a151d338c3d3c4744c44da20e80ee48a81d0ad8b6a7383c7c6a1b.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 9 to add, 1 to change, 6 to destroy.
```
</details>